snlkuharlocal/src/DataProcessors/РасчетОтчета/РасчетОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасчетОтчета</name>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Построитель</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОтчет</name>
    <type>
      <types>DocumentObject.Отчет</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделОтчета</name>
    <type>
      <types>CatalogRef.АналитикаОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТР</name>
    <attributes>
      <name>РазделОтчета</name>
      <type>
        <types>CatalogRef.АналитикаОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка1</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка2</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка3</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Привязка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регистр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакПривязки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/Catalogs/АналитикаОтчетов/АналитикаОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитикаОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>Знак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расчетная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Привязка</name>
    <comment>&quot;+&quot; - привязка только на приход,&quot;-&quot; - только на расход, пусто - без разницы</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗнакOLAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаOLAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Привязки</name>
    <attributes>
      <name>ИмяРегистра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИтога</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Привязки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПостроителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Знак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРасшифровка1</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРасшифровка2</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаписиРезультата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговоеСальдо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолеЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Привязки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/РасчетОтчета/ObjectModule.bsl
Процедура РазвернутьГруппировки(Результат,Уровень=0)
	Группировка=Построитель.ИзмеренияСтроки[Уровень].Имя;
	Выборка=Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,Группировка);
	Пока Выборка.Следующий() Цикл
		Сообщить("Уровень: "+Уровень);
		Если Уровень<Построитель.ИзмеренияСтроки.Количество()-1 Тогда
			РазвернутьГруппировки(Выборка,Уровень+1)	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
 
Процедура ВыполнитьРасчет(ТД=Неопределено) Экспорт

	ВыводитьОтчет=?(ТД=Неопределено,Ложь,Истина);
	
	ТР.Очистить();
	
	Макет=ПолучитьМакет("Заголовки");
	
	Если НЕ РазделОтчета.Пустая() Тогда
		ВыборкаРазделов=Справочники.АналитикаОтчетов.Выбрать(,ВидОтчета,Новый Структура("Код",РазделОтчета.Код),"Код");		
	Иначе
		ВыборкаРазделов=Справочники.АналитикаОтчетов.Выбрать(,ВидОтчета,,"Код");		
	КонецЕсли; 
		
	Пока ВыборкаРазделов.Следующий() Цикл
		ОбработкаПрерыванияПользователя();
		
		Если ВыводитьОтчет Тогда		
			ОблРаздела=Макет.ПолучитьОбласть("РазделОтчета");
			ОблРаздела.Параметры.РазделОтчета=ВыборкаРазделов.Наименование;
			
			ТД.Вывести(ОблРаздела);	
			
			ТД.НачатьГруппуСтрок(ВыборкаРазделов.Наименование);			
		КонецЕсли;		
		
		Для Каждого Привязка Из ВыборкаРазделов.Привязки Цикл
			ОбработкаПрерыванияПользователя();
			
			Попытка
				Показатели=ВыборкаРазделов.Показатели.НайтиСтроки(Новый Структура("ИД_Привязки",Привязка.ИД_Привязки));
				
				Построитель.ТекстЗаголовка	= Привязка.Наименование;
				Построитель.ВыводитьЗаголовокОтчета=Истина;
				
				Построитель.Текст			= Привязка.ТекстПостроителя;
				Построитель.ЗаполнитьНастройки();
				
				Настройки=Привязка.Фильтр.Получить();
				Если ТипЗнч(Настройки)=Тип("НастройкиПостроителяОтчета") Тогда
					Построитель.УстановитьНастройки(Настройки);									
				КонецЕсли;
				
				Построитель.ОбрабатыватьПрерываниеПользователя=Истина;
				
				Построитель.Параметры.Вставить("Дата1",НачалоДня(Дата1));
				Построитель.Параметры.Вставить("Дата2",КонецДня(Дата2));
				
				Построитель.Параметры.Вставить("Организация",Организация);
				
				Если НЕ ДокОтчет.Подразделение.Пустая() Тогда					
					Если Построитель.ДоступныеПоля.Найти("Подразделение")<>Неопределено Тогда
						ЭО=Построитель.Отбор.Добавить("Подразделение");
						ЭО.ВидСравнения	=ВидСравнения.ВИерархии;
						ЭО.Значение		=ДокОтчет.Подразделение;
						ЭО.Использование=Истина;						
					КонецЕсли;			
				КонецЕсли; 
				
				Состояние("Расчет: "+ВыборкаРазделов.Наименование+" "+Привязка.Наименование);
				Построитель.Выполнить();
				
				ТРП=ТР.ВыгрузитьКолонки();
				
				ЕстьПодразделение=(Построитель.Результат.Колонки.найти("Подразделение")<>Неопределено); 
				
				ВыборкаРезультатов=Построитель.Результат.Выбрать();
				Пока ВыборкаРезультатов.Следующий() Цикл
					Если ВыборкаРезультатов.ТипЗаписи()=ТипЗаписиЗапроса[Привязка.ТипЗаписиРезультата] Тогда 
						Для Каждого Показатель Из Показатели Цикл
							Если НЕ ПустаяСтрока(Показатель.ПолеЗапроса) Тогда
								Значение	= ВыборкаРезультатов[Показатель.ПолеЗапроса];
							Иначе
								Значение	= 0;						
							КонецЕсли;							
							
							Значение	=?(Значение=Null,0,Значение)*Привязка.Знак;
							
							Если НЕ ЗначениеЗаполнено(Значение) Тогда Продолжить КонецЕсли; 
							
							СтрокаТР=ТРП.Добавить();
							
							СтрокаТР.РазделОтчета	=ВыборкаРазделов.Ссылка;						
							СтрокаТР.Привязка		=Привязка.Наименование;
							СтрокаТР.Показатель		=Показатель.Показатель;
							СтрокаТР.Значение		=Значение;
							СтрокаТР.Регистр		=Привязка.ИмяРегистра;
							СтрокаТР.ЗнакПривязки	=Привязка.Знак;
							
							Если ЕстьПодразделение Тогда
								СтрокаТР.Подразделение=ВыборкаРезультатов.Подразделение;							
							КонецЕсли; 
							
							Для Сч=1 По 2 Цикл
								ИмяРасшифровки="Расшифровка"+Сч;
								
								Если ЗначениеЗаполнено(Привязка[ИмяРасшифровки]) Тогда 
									Если Привязка[ИмяРасшифровки]="__Привязка" Тогда
										СтрокаТР[ИмяРасшифровки]	=Привязка.Наименование;								
									Иначе
										СтрокаТР[ИмяРасшифровки]	=ВыборкаРезультатов[Привязка[ИмяРасшифровки]];
										Если НЕ ЗначениеЗаполнено(СтрокаТР[ИмяРасшифровки]) Тогда
											СтрокаТР[ИмяРасшифровки]	="<!--НЕ ОПРЕДЕЛЕНО--!>";														
										КонецЕсли;								
									КонецЕсли;
								Иначе
									СтрокаТР[ИмяРасшифровки]		=Привязка["Значение"+ИмяРасшифровки];
								КонецЕсли;							
							КонецЦикла;							
						КонецЦикла;					
					КонецЕсли;			
				КонецЦикла;				
				
				Если СокрЛП(Привязка.ИтоговоеСальдо)="Положительное" ИЛИ СокрЛП(Привязка.ИтоговоеСальдо)="Отрицательное" Тогда
					ТРП_Св=ТРП.Скопировать();				
					ТРП_Св.Свернуть("Показатель","Значение");
					Для Каждого СтрокаТРП_Св Из ТРП_Св Цикл
						Если 
								(СокрЛП(Привязка.ИтоговоеСальдо)="Положительное" И СтрокаТРП_Св.Значение<0)
							ИЛИ (СокрЛП(Привязка.ИтоговоеСальдо)="Отрицательное" И СтрокаТРП_Св.Значение>0) Тогда
							
							СтрокиКУдалению=ТРП.НайтиСтроки(Новый Структура("Показатель",СтрокаТРП_Св.Показатель));
							Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
								ТРП.Удалить(СтрокаКУдалению);							
							КонецЦикла; 
						КонецЕсли;		
					КонецЦикла; 				
				КонецЕсли;				
				
				Для Каждого СтрокаТРП Из ТРП Цикл
					СтрокаТР=ТР.Добавить();				
					ЗаполнитьЗначенияСвойств(СтрокаТР,СтрокаТРП);				
				КонецЦикла;
				
				Если ВыводитьОтчет Тогда
					Построитель.Макет=Неопределено;
					Построитель.МакетОформления=ПолучитьМакетОформления(СтандартноеОформление.Классика);
					
					Построитель.Вывести(ТД);
				КонецЕсли;
			Исключение
				Сообщить("Ошибка расчета раздела: ("+ВыборкаРазделов.Код+") "+ВыборкаРазделов.Наименование+", привязка: "+Привязка.Наименование+". "+ОписаниеОшибки(),СтатусСообщения.Важное);
			КонецПопытки;
		КонецЦикла;	
		
		Если ВыводитьОтчет Тогда
			ТД.ЗакончитьГруппуСтрок();
		КонецЕсли;
	КонецЦикла;
	
	ТР.Свернуть("Подразделение,РазделОтчета,Регистр,Расшифровка1,Расшифровка2,Привязка,ЗнакПривязки,Показатель","Значение");
КонецПроцедуры
